## 连接数据

### 添加行-DataFrame连接

In [1]:
# 加载多份数据，并连接起来
import pandas as pd
df1 = pd.read_csv('data/concat_1.csv')
df2 = pd.read_csv('data/concat_2.csv')
df3 = pd.read_csv('data/concat_3.csv')

In [2]:
print(df1)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [3]:
print(df2)

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [4]:
print(df3)

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [5]:
# 可以使用concat函数将上面3个DataFrame连接起来
# 需将3个DataFrame放到同一个列表中
row_concat = pd.concat([df1,df2,df3])
print(row_concat)

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [6]:
# 从上面的结果中可以看到，concat函数把3个DataFrame连接在了一起（简单堆叠）
# 可以通过 iloc ,loc等方法取出连接后的数据的子集

row_concat.iloc[3,]

A    a3
B    b3
C    c3
D    d3
Name: 3, dtype: object

In [7]:
row_concat.loc[3,]

     A    B    C    D
3   a3   b3   c3   d3
3   a7   b7   c7   d7
3  a11  b11  c11  d11

### 添加行-DataFrame和Series连接

In [8]:
# 使用concat连接DataFrame和Series
new_series = pd.Series(['n1','n2','n3','n4'])
print(new_series)

0    n1
1    n2
2    n3
3    n4
dtype: object

In [9]:
pd.concat([df1,new_series])

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4

In [10]:
# 由于Series是列数据，concat方法默认是添加行，但是Series数据没有行索引，
# 所以添加了一个新列，缺失的数据用NaN填充
# NaN是Python用于表示“缺失值”的方法
# 如果想将['n1','n2','n3','n4']作为行连接到df1后，可以创建DataFrame并指定列名
# 注意[['n1','n2','n3','n4']] 是两个中括号
new_row_df = pd.DataFrame([['n1','n2','n3','n4']],columns=['A','B','C','D'])

In [11]:
new_row_df

    A   B   C   D
0  n1  n2  n3  n4

In [12]:
pd.concat([df1,new_row_df])

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

### 添加行-append函数

In [13]:
# concat可以连接多个对象，如果只需要向现有DataFrame追加一个对象，可以通过append函数来实现
df1.append(df2)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [14]:
df1.append(new_row_df)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

In [15]:
# 使用Python字典添加数据行
# DataFrame中append一个字典的时候，必须传入ignore_index = True
data_dict = {'A':'n1','B':'n2','C':'n3','D':'n4'}
df1.append(data_dict,ignore_index=True)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  n1  n2  n3  n4

### 添加行-重置索引

In [16]:
# 如果是两个或者多个DataFrame连接，可以通过ignore_index = True参数，忽略后面DataFrame的索引
row_concat_ignore_index = pd.concat([df1,df2,df3],ignore_index=True)
print(row_concat_ignore_index)

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

### 添加列-concat函数

In [17]:
# 使用concat函数添加列，与添加行的方法类似
# 需要多传一个axis参数 axis的默认值是index 按行添加，传入参数 axis = columns 即可按列添加
col_concat = pd.concat([df1,df2,df3],axis=1)
print(col_concat)

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [20]:
#通过列名获取子集
print(col_concat['A'])

    A   A    A
0  a0  a4   a8
1  a1  a5   a9
2  a2  a6  a10
3  a3  a7  a11

### 添加列-通过dataframe['列名'] = ['值']

In [21]:
# 向DataFrame添加一列，不需要调用函数，通过dataframe['列名'] = ['值'] 即可
col_concat['new_col'] = ['n1','n2','n3','n4']
print(col_concat)

    A   B   C   D   A   B   C   D    A    B    C    D new_col
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8      n1
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9      n2
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10      n3
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11      n4

### 添加列-通过dataframe['列名'] = Series对象

In [22]:
# 通过dataframe['列名'] = Series对象 这种方式添加一列
col_concat['new_col_series'] = pd.Series(['n1','n2','n3','n4'])
col_concat

    A   B   C   D   A   B   C   D    A    B    C    D new_col new_col_series
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8      n1             n1
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9      n2             n2
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10      n3             n3
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11      n4             n4

### 添加列-重置索引

In [23]:
# 按列合并数据之后，可以重置列索引，获得有序索引
pd.concat([df1,df2,df3],axis = 'columns',ignore_index=True)

    0   1   2   3   4   5   6   7    8    9   10   11
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

## 合并多个数据集

### 加载数据

In [25]:
from sqlalchemy import create_engine
#需要安装sqlalchemy  pip install sqlalchemy
engine = create_engine('sqlite:///data/chinook.db')
#连接数据库
tracks = pd.read_sql_table('tracks', engine)
tracks.head()

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

In [26]:
# 从数据库中读取表，第一个参数是表名，第二个参数是数据库连接对象
genres = pd.read_sql_table('genres', engine)
print(genres)

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

### 一对一合并

In [27]:
#先从tracks中提取部分数据，使其不含重复的'GenreId’值
tracks_subset = tracks.loc[[0,62,76,98,110,193,204,281,322,359],]
tracks_subset

# 通过'GenreId'列合并数据，how参数指定连接方式
# how = ’left‘ 对应SQL中的 left outer 保留左侧表中的所有key
# how = ’right‘ 对应SQL中的 right outer 保留右侧表中的所有key
# how = 'outer' 对应SQL中的 full outer 保留左右两侧侧表中的所有key
# how = 'inner' 对应SQL中的 inner 只保留左右两侧都有的key

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
62,63,Desafinado,8,1,2,None,185338,5990473,0.99
76,77,Enter Sandman,9,1,3,Apocalyptica,221701,7286305,0.99
98,99,Your Time Has Come,11,1,4,"Cornell, Commerford, Morello, Wilk",255529,8273592,0.99
110,111,Money,12,1,5,"Berry Gordy, Jr./Janie Bradford",147591,2365897,0.99
193,194,First Time I Met The Blues,20,1,6,Eurreal Montgomery,140434,4604995,0.99
204,205,Jorge Da Capadócia,21,1,7,Jorge Ben,177397,5842196,0.99
281,282,Girassol,26,1,8,Bino Farias/Da Gama/Lazão/Pedro Luis/Toni Garrido,249808,8327676,0.99
322,323,"Dig-Dig, Lambe-Lambe (Ao Vivo)",29,1,9,Cassiano Costa/Cintia Maviane/J.F./Lucas Costa,205479,6892516,0.99
359,360,Vai-Vai 2001,32,1,10,None,276349,9402241,0.99

In [28]:
# left
genre_track = genres.merge(tracks_subset[['TrackId','GenreId', 'Milliseconds']], on='GenreId', how='left')                           
print(genre_track)
# right
genre_track = genres.merge(tracks_subset[['TrackId','GenreId', 'Milliseconds']], on='GenreId', how='right')                           
print(genre_track)

    GenreId                Name  TrackId  Milliseconds
0         1                Rock      1.0      343719.0
1         2                Jazz     63.0      185338.0
2         3               Metal     77.0      221701.0
3         4  Alternative & Punk     99.0      255529.0
4         5       Rock And Roll    111.0      147591.0
5         6               Blues    194.0      140434.0
6         7               Latin    205.0      177397.0
7         8              Reggae    282.0      249808.0
8         9                 Pop    323.0      205479.0
9        10          Soundtrack    360.0      276349.0
10       11          Bossa Nova      NaN           NaN
11       12      Easy Listening      NaN           NaN
12       13         Heavy Metal      NaN           NaN
13       14            R&B/Soul      NaN           NaN
14       15   Electronica/Dance      NaN           NaN
15       16               World      NaN           NaN
16       17         Hip Hop/Rap      NaN           NaN
17       18     Science Fiction      NaN           NaN
18       19            TV Shows      NaN           NaN
19       20    Sci Fi & Fantasy      NaN           NaN
20       21               Drama      NaN           NaN
21       22              Comedy      NaN           NaN
22       23         Alternative      NaN           NaN
23       24           Classical      NaN           NaN
24       25               Opera      NaN           NaN
   GenreId                Name  TrackId  Milliseconds
0        1                Rock        1        343719
1        2                Jazz       63        185338
2        3               Metal       77        221701
3        4  Alternative & Punk       99        255529
4        5       Rock And Roll      111        147591
5        6               Blues      194        140434
6        7               Latin      205        177397
7        8              Reggae      282        249808
8        9                 Pop      323        205479
9       10          Soundtrack      360        276349

### 多对一合并

In [29]:
#使用tracks的全部数据
genre_track = genres.merge(tracks[['TrackId','GenreId', 'Milliseconds']], on='GenreId', how='left')                           
print(genre_track)

      GenreId       Name  TrackId  Milliseconds
0           1       Rock        1        343719
1           1       Rock        2        342562
2           1       Rock        3        230619
3           1       Rock        4        252051
4           1       Rock        5        375418
...       ...        ...      ...           ...
3498       24  Classical     3499        286741
3499       24  Classical     3500        139200
3500       24  Classical     3501         66639
3501       24  Classical     3502        221331
3502       25      Opera     3451        174813

[3503 rows x 4 columns]

In [32]:
# 转换时间单位
# 如上面结果所示，Name的值在合并后的数据中被复制了 
# 计算每种类型音乐的平均时长
# to_timedelta 将Milliseconds列转变为timedelta数据类型
# 参数unit='ms' 时间单位
# dt.floor('s') dt.floor() #时间类型数据，按指定单位截断数据

In [33]:
genre_time = genre_track.groupby('Name')['Milliseconds'].mean()
pd.to_timedelta(genre_time, unit='ms').dt.floor('s').sort_values()

Name
Rock And Roll        00:02:14
Opera                00:02:54
Hip Hop/Rap          00:02:58
Easy Listening       00:03:09
Bossa Nova           00:03:39
R&B/Soul             00:03:40
World                00:03:44
Pop                  00:03:49
Latin                00:03:52
Alternative & Punk   00:03:54
Soundtrack           00:04:04
Reggae               00:04:07
Alternative          00:04:24
Blues                00:04:30
Rock                 00:04:43
Jazz                 00:04:51
Classical            00:04:53
Heavy Metal          00:04:57
Electronica/Dance    00:05:02
Metal                00:05:09
Comedy               00:26:25
TV Shows             00:35:45
Drama                00:42:55
Science Fiction      00:43:45
Sci Fi & Fantasy     00:48:31
Name: Milliseconds, dtype: timedelta64[ns]

In [34]:
# 计算每名用户的平均消费
# 从三张表中获取数据，用户表获取用户id，姓名
# 发票表，获取发表id，用户id
# 发票详情表，获取发票id,单价，数量
cust = pd.read_sql_table('customers',engine,columns=['CustomerId', 'FirstName', 'LastName'])
invoice = pd.read_sql_table('invoices',engine,columns=['InvoiceId','CustomerId'])
ii = pd.read_sql_table('invoice_items',engine,columns=['InvoiceId', 'UnitPrice', 'Quantity'])

In [35]:
#根据用户Id('CustomerId')合并用户表和发票表，根据发票Id ('InvoiceId')合并发票和发票详情表
cust_inv = cust.merge(invoice, on='CustomerId').merge(ii, on='InvoiceId')
print(cust_inv.head())

   CustomerId FirstName   LastName  InvoiceId  UnitPrice  Quantity
0           1      Luís  Gonçalves         98       1.99         1
1           1      Luís  Gonçalves         98       1.99         1
2           1      Luís  Gonçalves        121       0.99         1
3           1      Luís  Gonçalves        121       0.99         1
4           1      Luís  Gonçalves        121       0.99         1

In [36]:
# 计算用户每笔消费的总金额
# DataFrame的assign方法 创建新列
total = cust_inv['Quantity'] * cust_inv['UnitPrice']
cust_inv = cust_inv.assign(Total = total)
print(cust_inv.head())

   CustomerId FirstName   LastName  InvoiceId  UnitPrice  Quantity  Total
0           1      Luís  Gonçalves         98       1.99         1   1.99
1           1      Luís  Gonçalves         98       1.99         1   1.99
2           1      Luís  Gonçalves        121       0.99         1   0.99
3           1      Luís  Gonçalves        121       0.99         1   0.99
4           1      Luís  Gonçalves        121       0.99         1   0.99

In [37]:
# 按照用户Id，姓名分组，分组后对总金额求和，并排序
cols = ['CustomerId', 'FirstName', 'LastName']
cust_inv.groupby(cols)['Total'].sum().sort_values(ascending=False).head()

CustomerId  FirstName  LastName
6           Helena     Holý          49.62
26          Richard    Cunningham    47.62
57          Luis       Rojas         46.62
46          Hugh       O'Reilly      45.62
45          Ladislav   Kovács        45.62
Name: Total, dtype: float64

### join合并

In [38]:
# 加载数据
stocks_2016 = pd.read_csv('data/stocks_2016.csv')
stocks_2017 = pd.read_csv('data/stocks_2017.csv')
stocks_2018 = pd.read_csv('data/stocks_2018.csv')

In [39]:
stocks_2016

  Symbol  Shares  Low  High
0   AAPL      80   95   110
1   TSLA      50   80   130
2    WMT      40   55    70

In [40]:
stocks_2017

  Symbol  Shares  Low  High
0   AAPL      50  120   140
1     GE     100   30    40
2    IBM      87   75    95
3    SLB      20   55    85
4    TXN     500   15    23
5   TSLA     100  100   300

In [41]:
stocks_2018

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

In [43]:
# 依据两个DataFrame的行索引
# 如果合并的两个数据有相同的列名，需要通过lsuffix，和rsuffix，指定合并后的列名的后缀
stocks_2016.join(stocks_2017, lsuffix='_2016', rsuffix='_2017', how='outer')

,Symbol_2016,Shares_2016,Low_2016,High_2016,Symbol_2017,Shares_2017,Low_2017,High_2017
0,AAPL,80.0,95.0,110.0,AAPL,50,120,140
1,TSLA,50.0,80.0,130.0,GE,100,30,40
2,WMT,40.0,55.0,70.0,IBM,87,75,95
3,NaN,NaN,NaN,NaN,SLB,20,55,85
4,NaN,NaN,NaN,NaN,TXN,500,15,23
5,NaN,NaN,NaN,NaN,TSLA,100,100,300

In [44]:
# 将两个DataFrame的Symbol设置为行索引，再次join数据
stocks_2016.set_index('Symbol').join(stocks_2018.set_index('Symbol'),lsuffix='_2016', rsuffix='_2018')

        Shares_2016  Low_2016  High_2016  Shares_2018  Low_2018  High_2018
Symbol
AAPL             80        95        110         40.0     135.0      170.0
TSLA             50        80        130         50.0     220.0      400.0
WMT              40        55         70          NaN       NaN        NaN

In [45]:
# 将一个DataFrame的Symbol列设置为行索引，与另一个DataFrame的Symbol列进行join
stocks_2016.join(stocks_2018.set_index('Symbol'),lsuffix='_2016', rsuffix='_2018',on='Symbol')

  Symbol  Shares_2016  Low_2016  High_2016  Shares_2018  Low_2018  High_2018
0   AAPL           80        95        110         40.0     135.0      170.0
1   TSLA           50        80        130         50.0     220.0      400.0
2    WMT           40        55         70          NaN       NaN        NaN